app/views/lessons/_sidebar.html.erb

<div class="w-full">
    <% course.lessons.order(:position).each do |lesson| %>
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."course_id" = ? ORDER BY "lessons"."position" ASC  [["course_id", 1]]