app/views/courses/_sidebar.html.erb

          <% if @completed_lessons&.any? %>
            <% if @completed_lessons.count == @course.lessons.count %>
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."course_id" = ? ORDER BY "lessons"."id" ASC LIMIT ?  [["course_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "lessons" WHERE "lessons"."course_id" = ?  [["course_id", 1]]