app/views/courses/show.html.erb

SELECT "lessons".* FROM "lessons" WHERE "lessons"."course_id" = ? ORDER BY "lessons"."id" ASC LIMIT ?  [["course_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "lessons" WHERE "lessons"."course_id" = ? LIMIT ?  [["course_id", 1], ["LIMIT", 1]]
---

    <% if @course.lessons.any? && @course.lessons.first.video.present? %>
      <%= video_tag @course.lessons.first.video, controls: true, class: "w-full rounded mb-6" %>

SELECT "categories".* FROM "categories" INNER JOIN "categories_courses" ON "categories"."id" = "categories_courses"."category_id" WHERE "categories_courses"."course_id" = ?  [["course_id", 1]]
---
      <div class="flex justify-start items-center flex-wrap w-full mb-2">
        <% @course.categories.each do |category| %>

SELECT COUNT(*) FROM "lessons" WHERE "lessons"."course_id" = ?  [["course_id", 1]]
---
      </div>
      <span><%= @course.lessons.count %> <%= "lesson".pluralize(@course.lessons.count) %> </span>