app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses"
---
  def index
    @courses = Course.all

SELECT "lesson_users"."lesson_id" FROM "lesson_users" INNER JOIN "lessons" "lesson" ON "lesson"."id" = "lesson_users"."lesson_id" WHERE "lesson_users"."user_id" = ? AND "lesson_users"."completed" = ? AND "lesson"."course_id" = ?  [["user_id", 2], ["completed", 1], ["course_id", 1]]
---
  def show
    @completed_lessons = current_user&.lesson_users&.joins(:lesson)&.where(completed: true, lesson: { course: @course })&.pluck(:lesson_id)

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_course
      @course = Course.find(params[:id])