app/controllers/lessons_controller.rb

  def show
    @completed_lessons = current_user.lesson_users.where(completed:true).pluck(:lesson_id)
---
SELECT "lesson_users"."lesson_id" FROM "lesson_users" WHERE "lesson_users"."user_id" = ? AND "lesson_users"."completed" = ?  [["user_id", 2], ["completed", 1]]

  def update
    @lesson_user = LessonUser.find_or_create_by(user: current_user, lesson: @lesson)
    @lesson_user.update!(completed: true)
    next_lesson = @course.lessons.where("position > ?", @lesson.position).order(:position).first
---
INSERT INTO "lesson_users" ("lesson_id", "user_id", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["lesson_id", 3], ["user_id", 2], ["completed", nil], ["created_at", "2024-07-06 21:16:59.481688"], ["updated_at", "2024-07-06 21:16:59.481688"]]
SELECT "lesson_users".* FROM "lesson_users" WHERE "lesson_users"."user_id" = ? AND "lesson_users"."lesson_id" = ? LIMIT ?  [["user_id", 2], ["lesson_id", 3], ["LIMIT", 1]]
UPDATE "lesson_users" SET "completed" = ?, "updated_at" = ? WHERE "lesson_users"."id" = ?  [["completed", 1], ["updated_at", "2024-07-06 21:16:59.485986"], ["id", 3]]
SELECT "lessons".* FROM "lessons" WHERE "lessons"."course_id" = ? AND (position > NULL) ORDER BY "lessons"."position" ASC LIMIT ?  [["course_id", 1], ["LIMIT", 1]]

    def set_course
      @course = Course.find(params[:course_id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_lesson
      @lesson = Lesson.find(params[:id])
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_lesson
      @lesson = Lesson.find(params[:id])
---
SELECT "lessons".* FROM "lessons" WHERE "lessons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]