app/models/course.rb

SELECT "lessons".* FROM "lessons" WHERE "lessons"."course_id" = ? ORDER BY "lessons"."position" ASC LIMIT ?  [["course_id", 1], ["LIMIT", 1]]
---
    def first_lesson
      self.lessons.order(:position).first